const roles: any = {

    'Реализатор': {
        haracteristic: 'Характеристика. Реализаторам присущи практический здравый смысл и хорошее чувство самоконтроля и дисциплины. Они любят тяжелую работу и преодоление проблем в системном режиме. В большей степени Реализаторы являются типичными личностями, чья верность и интерес совпадают с ценностями компании. Они менее сконцентрированы на преследовании собственных интересов. Тем не менее им может не хватать спонтанности, и они могут проявлять жесткость и непреклонность.',

        functionality: 'Функциональность. Они очень полезны компании благодаря своей надежности и прилежанию. Они добиваются успеха, потому что очень работоспособны и могут четко определить то, что выполнимо и имеет отношение к делу. Говорят, что многие исполнители делают ту работу, которую хотят делать и пренебрегают заданиями, которые находят неприятными. Реализаторы часто продвигаются до высоких должностных позиций в управлении благодаря своим хорошим организаторским способностями и компетентности в решении всех важных вопросов.'

    },

    'Координатор': {

        haracteristic: 'Характеристика. Отличительной чертой Координаторов является способность заставлять других работать над распределенными целями. Зрелый, опытный, уверенный, Координатор охотно раздает поручения. В межличностных отношениях они быстро раскрывают индивидуальные наклонности и таланты и мудро их используют для достижения целей команды. Они не обязательно самые умные члены команды, это люди с большим кругозором и опытом, пользующиеся общим уважением команды.',

        functionality: 'Функциональность. Они хорошо себя проявляют, находясь во главе команды людей с различными навыками и характерами. Они лучше работают совместно с коллегами равными по рангу или позиции, чем с сотрудниками более низких уровней. Их девизом может быть «консультация с контролем». Они верят, что проблему можно решить мирным путем. В некоторых компаниях Координаторы могут вступать в конфликты из-за разности во взглядах с Творцами.'

    },

    'Творец': {

        haracteristic: 'Характеристика. Это люди с высоким уровнем мотивации, неисчерпаемой энергией и великой жаждой достижений. Обычно это ярко выраженные экстраверты, обладающие сильной напористостью. Им нравится вести других и подталкивать к действиям. Если возникают препятствия, они быстро находят обходные пути. Своевольные и упрямые, уверенные и напористые, они имеют склонность эмоционально отвечать на любую форму разочарования или крушения планов. Целеустремленные, любящие поспорить. Но им часто не хватает простого человеческого понимания. Их роль самая конкурентная в команде.',

        functionality: 'Функциональность. Они обычно становятся хорошими руководителями благодаря тому, что умеют генерировать действия и успешно работать под давлением. Они умеют легко воодушевлять команду и очень полезны в группах с разными взглядами, так как способны укротить страсти. Творцы способны парить над проблемами такого рода, продолжая лидировать, не считаясь с ними. Они могут легко провести необходимые изменения и не отказываются от нестандартных решений. Отвечая названию, они пытаются навязывать группе некоторые образцы или формы поведения и деятельности. Они являются самыми эффективными членами команды, способными гарантировать позитивные действия.'

    },

    'Генератор идей': {

        haracteristic: 'Характеристика. Генераторы идей являются инноваторами и изобретателями, могут быть очень креативными. Они сеют зерно и идеи, из которых прорастают большинство разработок и проектов. Обычно они предпочитают работать самостоятельно, отделившись от других членов команды, используя свое воображение и часто следуя нетрадиционным путем. Имеют склонность быть интровертами, сильно реагируют как на критику, так и на похвалу. Часто из идеи имеют радикальный характер, и им не хватает практических усилий. Они независимы, умны и оригинальны, но могут быть слабыми в общении с людьми другого уровня или направления.',

        functionality: 'Функциональность. Основная функция Генераторов идей – создание новых предложений и решение сложных комплексных проблем. Они очень необходимы на начальных стадиях проектов или когда проект находится под угрозой срыва. Они обычно являются основателями компаний или организаторами новых производств. Тем не менее большое количество Генераторов идей в одной компании может привести к контрпродуктивности, так как они имеют тенденцию проводить время, укрепляя собственные идеи и вступая друг с другом в конфликт.'
    },

    'Исследователь': {

        haracteristic: 'Характеристика. Исследователи – часто энтузиасты и яркие экстраверты. Они умеют общаться с людьми в компании и за ее пределами. Они рождены для ведения переговоров, исследования новых возможностей и налаживания контактов. Хотя и не являясь генераторами гениальных идей, они очень легко подхватывают идеи других и развивают их. Они очень легко распознают, что есть в наличии и что еще можно сделать. Их обычно очень тепло принимают в команде благодаря их открытой натуре. Они всегда открыты и любознательны, готовы найти возможности во всем новом. Но, если они не стимулируются другими, их энтузиазм быстро снижается.',

        functionality: 'Функциональность. Они очень хорошо реагируют и отвечают на новые идеи и разработки, могут найти ресурсы и вне группы. Они самые подходящие люди для установки внешних контактов и проведения последующих переговоров. Они умеют самостоятельно думать, получая информацию от других.'
    },
    "Эксперт": {

        haracteristic: 'Характеристика. Это очень серьезные и предусмотрительные люди с врожденным иммунитетом против чрезмерного энтузиазма. Медлительны в принятии решения, предпочитают хорошо все обдумать. Они способны критически мыслить. Они умеют быть проницательными в суждениях, принимая во внимание все факторы. Эксперты редко ошибаются.',

        functionality: 'Функциональность. Эксперты наиболее подходят для анализа проблем и оценки идей и предложений. Они хорошо умеют взвешивать все «за» и «против» предложенных вариантов. По сравнению с другими Эксперты кажутся черствыми, занудными и чрезмерно критичными. Некоторые удивляются, как им удается стать руководителями. Тем не менее многие эксперты занимают стратегические посты и преуспевают на должностях высшего ранга. Очень редко удача или срыв дела зависит от принятия спешных решений. Это идеальная «сфера» для Экспертов, людей, которые редко ошибаются и в конце концов выигрывают.'

    },
    "Дипломат": {

        haracteristic: 'Характеристика. Это люди, пользующиеся наибольшей поддержкой команды. Они очень вежливы, обходительны и общительны. Они умеют быть гибкими и адаптироваться к любой ситуации и разным людям. Дипломаты очень дипломатичны и восприимчивы. Они умеют слушать других и сопереживать, очень популярны в команде. В работе они полагаются на чувствительность, но могут столкнуться с трудностью при принятии решений в срочных и неотложных ситуациях.',

        functionality: 'Функциональность. Роль Дипломатов состоит в предотвращении межличностных проблем, появляющихся в команде, и поэтому это позволяет эффективно работать всем ее членам. Избегая трений, они будут идти длинной дорогой ради того, чтобы обойти их стороной. Они не часто становятся руководителями, тем более если их непосредственный начальник подчиняется Творцу. Это создает климат, в котором дипломатия и восприимчивость людей этого типа является настоящей находкой для команды, особенно при управленческом стиле, где конфликты могут возникать и должны искусственно пресекаться. Такие люди в качестве руководителя не представляют угрозу ни для кого и поэтому всегда желанны для подчиненных. Дипломаты служат своего рода «смазкой» для команды, а люди в такой обстановке сотрудничают лучше.'

    },
    "Исполнитель": {

        haracteristic: 'Характеристика. Обладают огромной способностью доводить дело до завершения и обращать внимание на детали. Они никогда не начинают то, что не могут довести до конца. Они мотивируются внутренним беспокойством, хотя часто внешне выглядят спокойными и невозмутимыми. Представители этого типа часто являются интровертами. Им обычно не требуется стимулирование извне или побуждения. Они не терпят случайностей. Не склонны к делегированию, предпочитают выполнять задания самостоятельно.',

        functionality: 'Функциональность. Являются незаменимыми в ситуациях, когда задания требуют сильной концентрированности и высокого уровня аккуратности. Они несут чувство срочности и неотложности в команду и хорошо проводят различные митинги. Хорошо справляются с управлением благодаря своему стремлению к высшим стандартам, своей аккуратности, точности, вниманию к деталям и умению завершать начатое дело.'

    }
};

// первая цифра - номер страницы( начинаються с 0),
// вотрая цира - номер вопроса ( начинаються с 0)
const keys: any = {
    'Реализатор': [
        '06',
        '10',
        '27',
        '33',
        '41',
        '55',
        '64'
    ],
    'Координатор': [
        '03',
        '11',
        '20',
        '37',
        '45',
        '52',
        '66'
    ],
    'Творец': [
        '05',
        '14',
        '22',
        '31',
        '43',
        '56',
        '60'
    ],
    'Генератор идей': [
        '02',
        '16',
        '23',
        '34',
        '47',
        '50',
        '65'
    ],
    'Исследователь': [
        '00',
        '12',
        '25',
        '36',
        '44',
        '57',
        '63'
    ],
    'Эксперт': [
        '07',
        '13',
        '26',
        '32',
        '40',
        '54',
        '61'
    ],
    'Дипломат': [
        '01',
        '15',
        '24',
        '30',
        '42',
        '51',
        '67'
    ],
    'Исполнитель': [
        '04',
        '17',
        '21',
        '35',
        '46',
        '53',
        '62'
    ]
}

export { roles, keys };